holiday-calendar-rails/app/controllers/holiday_calendars_controller.rb

  def calendars
    calendars = HolidayCalendar.all
---
SELECT `holiday_calendars`.* FROM `holiday_calendars`

  def calendar
    calendar = HolidayCalendar.find(params[:id])
---
SELECT  `holiday_calendars`.* FROM `holiday_calendars` WHERE `holiday_calendars`.`id` = 36 LIMIT 1